espressif/esp-idf/components/bt/controller/esp32c6/bt.c
int ble_sm_alg_gen_dhkey(const uint8_t *peer_pub_key_x, const uint8_t *peer_pub_key_y,
                         const uint8_t *our_priv_key, uint8_t *out_dhkey)
{
    uint8_t dh[32];
    uint8_t pk[BLE_PUB_KEY_LEN];
    uint8_t priv[32];
    int rc = BLE_SM_KEY_ERR;

    swap_buf(priv, our_priv_key, 32);

#if CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS
    // PSA/mbedTLS expects 65 bytes: 0x04 prefix + X (32 bytes) + Y (32 bytes)
    pk[0] = 0x04; // Uncompressed format for public key
    swap_buf(&pk[1], peer_pub_key_x, 32);
    swap_buf(&pk[33], peer_pub_key_y, 32);

    psa_key_id_t key_id = 0;
    psa_status_t status;
    psa_key_attributes_t key_attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_set_key_type(&key_attributes, PSA_KEY_TYPE_ECC_KEY_PAIR(PSA_ECC_FAMILY_SECP_R1));
    psa_set_key_bits(&key_attributes, 256);
    psa_set_key_algorithm(&key_attributes, PSA_ALG_ECDH);
    psa_set_key_usage_flags(&key_attributes, PSA_KEY_USAGE_DERIVE);
    status = psa_import_key(&key_attributes, priv, 32, &key_id);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG_SM_ALG, "Failed to import key: %d", status);
        goto exit;
    }
    psa_reset_key_attributes(&key_attributes);
    size_t output_len = 0;
    status = psa_raw_key_agreement(PSA_ALG_ECDH, key_id, pk, BLE_PUB_KEY_LEN, dh, sizeof(dh), &output_len);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG_SM_ALG, "Failed to perform raw key agreement: %d", status);
        goto exit;
    }

    if (output_len != 32) {
        ESP_LOGE(TAG_SM_ALG, "Unexpected output length: %zu", output_len);
        goto exit;
    }
    rc = 0;

exit:
    if (key_id != 0) {
        psa_destroy_key(key_id);
    }
    if (rc != 0) {
        return BLE_SM_KEY_ERR;
    }

#else
    // TinyCrypt/uECC expects 64 bytes: X (32 bytes) + Y (32 bytes), no prefix
    swap_buf(pk, peer_pub_key_x, 32);
    swap_buf(&pk[32], peer_pub_key_y, 32);

    if (uECC_valid_public_key(pk, &curve_secp256r1) < 0) {
        return BLE_SM_KEY_ERR;
    }

    rc = uECC_shared_secret(pk, priv, dh, uECC_secp256r1());
    if (rc == TC_CRYPTO_FAIL) {
        return BLE_SM_KEY_ERR;
    }
#endif // CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS

    swap_buf(out_dhkey, dh, 32);
    return 0;
}

#if CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS
static int mbedtls_gen_keypair(uint8_t *public_key, uint8_t *private_key)
{
    int rc = BLE_SM_KEY_ERR;
    psa_status_t status;
    psa_key_id_t key_id = 0;
    psa_key_attributes_t key_attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_algorithm_t alg = PSA_ALG_ECDH;
    psa_key_type_t key_type = PSA_KEY_TYPE_ECC_KEY_PAIR(PSA_ECC_FAMILY_SECP_R1);
    psa_key_usage_t key_usage = PSA_KEY_USAGE_DERIVE | PSA_KEY_USAGE_EXPORT;

    psa_set_key_type(&key_attributes, key_type);
    psa_set_key_bits(&key_attributes, 256);
    psa_set_key_algorithm(&key_attributes, alg);
    psa_set_key_usage_flags(&key_attributes, key_usage);
    status = psa_generate_key(&key_attributes, &key_id);
    if (status != PSA_SUCCESS) {
        goto exit;
    }
    psa_reset_key_attributes(&key_attributes);

    size_t olen = 0;
    status = psa_export_public_key(key_id, public_key, BLE_PUB_KEY_LEN, &olen);
    if (status != PSA_SUCCESS || olen != BLE_PUB_KEY_LEN) {
        goto exit;
    }

    status = psa_export_key(key_id, private_key, 32, &olen);
    if (status != PSA_SUCCESS || olen != 32) {
        goto exit;
    }

    psa_destroy_key(key_id);
    rc = 0;
exit:
    if (rc != 0) {
        return BLE_SM_KEY_ERR;
    }

    return 0;
}
#endif  // CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS

/**
 * pub: 64 bytes
 * priv: 32 bytes
 */
int ble_sm_alg_gen_key_pair(uint8_t *pub, uint8_t *priv)
{
#if CONFIG_BT_LE_SM_SC_DEBUG_KEYS
    swap_buf(pub, ble_sm_alg_dbg_pub_key, 32);
    swap_buf(&pub[32], &ble_sm_alg_dbg_pub_key[32], 32);
    swap_buf(priv, ble_sm_alg_dbg_priv_key, 32);
#else
    uint8_t pk[BLE_PUB_KEY_LEN];

    do {
#if CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS
        if (mbedtls_gen_keypair(pk, priv) != 0) {
            return BLE_SM_KEY_ERR;
        }
#else
        if (uECC_make_key(pk, priv, uECC_secp256r1()) != TC_CRYPTO_SUCCESS) {
            return BLE_SM_KEY_ERR;
        }
#endif  // CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS
        /* Make sure generated key isn't debug key. */
    } while (memcmp(priv, ble_sm_alg_dbg_priv_key, 32) == 0);

#if CONFIG_BT_LE_CRYPTO_STACK_MBEDTLS
    // PSA returns 65 bytes: 0x04 prefix + X (32 bytes) + Y (32 bytes)
    // Skip the 0x04 prefix when copying to pub
    swap_buf(pub, &pk[1], 32);
    swap_buf(&pub[32], &pk[33], 32);
#else
    // tinycrypt returns 64 bytes: X (32 bytes) + Y (32 bytes), no prefix
    swap_buf(pub, pk, 32);
    swap_buf(&pub[32], &pk[32], 32);
#endif
    swap_in_place(priv, 32);
#endif // CONFIG_BT_LE_SM_SC_DEBUG_KEYS
    return 0;
}

#endif // CONFIG_BT_LE_SM_LEGACY || CONFIG_BT_LE_SM_SC
#endif // (!CONFIG_BT_NIMBLE_ENABLED) && (CONFIG_BT_CONTROLLER_ENABLED)
#if CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED
#include "esp_gdbstub.h"
#endif // CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED

int IRAM_ATTR
ble_capture_info_user_handler(uint8_t type, uint32_t reason, uint32_t param1, uint32_t param2)
{
    int i;

    switch(type) {
        case 0:
            for (i = 0; i < 2; i++) {
                esp_ble_controller_info_capture(0x010101);
            }
#if CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED
            uintptr_t sp;
            __asm__ volatile ("mv %0, sp" : "=r" (sp));
            esp_gdbstub_panic_handler(&sp);
#endif // CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED
            break;
#if CONFIG_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED
        case 1:
            if ((reason == 0x08) || (reason == 0x3d) || (reason == 0x28)) {
                osi_assert_wrapper(__LINE__,__func__, type, reason);
            }
            break;
#endif // CONFIG_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED
        default:
            break;
    }
    return 0;
}

#if CONFIG_BT_LE_MEM_CHECK_ENABLED
void ble_memory_count_limit_set(uint16_t count_limit)
{
    bt_osi_mem_count_limit_set(count_limit);
}
#endif // CONFIG_BT_LE_MEM_CHECK_ENABLED
